tests/performance/auth-login.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 2
      name: Warm-up
    - duration: 20
      arrivalRate: 5
      name: Sustained load
  defaults:
    headers:
      Content-Type: "application/json"
  variables:
    password: "Str0ngPass!"
scenarios:
  - name: "Auth register + login"
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "perf-{{ $randomString(8) }}@test.local"
            password: "{{ password }}"
            role: "ADMIN"
          capture:
            - json: "$.user.email"
              as: "userEmail"
          expect:
            - statusCode: 201
      - think: 1
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200