tests/performance/checkin-traefik.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 20
      arrivalRate: 5
      name: Aquecimento
    - duration: 40
      arrivalRate: 10
      rampTo: 25
      name: Ramp-up
    - duration: 60
      arrivalRate: 25
      name: Sustentado
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./processors/checkin.js"
  variables:
    roomId: "stress-room-1"
scenarios:
  - name: "Check-in Burst"
    flow:
      - function: "generateCheckinPayload"
      - post:
          url: "/api/v1/checkin"
          json:
            studentId: "{{ studentId }}"
            roomId: "{{ roomId }}"
            identificationMethod: "MATRICULA"
            identificationValue: "{{ identificationValue }}"
          expect:
            - statusCode: 201
      - think: 0.5